const PolicyModal = Vue.component('policy', {
  template: `
  <div class="modal fade"
    id="policyModal" tabindex="-1" role="dialog"
    aria-labelledby="policyModalLabel" aria-hidden="true"
    style="z-index:1100"
  >
    <div class="modal-dialog modal-lg modal-dialog-scrollable" role="document">
      <div class="modal-content">
        <div class="modal-header">
          <h5 class="modal-title">Политика конфиденциальности</h5>
          <button type="button" class="close" data-dismiss="modal" aria-label="Close">
            <span aria-hidden="true">&times;</span>
          </button>
        </div>
        <div class="modal-body">
          <div class="row">
            <div class="col-11 mx-auto">
              <h2>Политика в отношении обработки и защиты персональных данных</h2>
              <p>ИП Кокин А.А. в отношении обработки и защиты персональных данных пользователей сайта <a href="https://mypolyana18.ru">mypolyana18.ru</a></p>
              <h3>1. ОБЩИЕ ПОЛОЖЕНИЯ</h3>
              <p>1.1. Настоящая Политика в отношении обработки и защиты персональных данных (далее – Политика) разработана в соответствии со статьей 18.1 Федерального закона от 27.07.2006 года № 152-ФЗ «О персональных данных» и является основным внутренним документом Индивидуального предпринимателя Кокина Александра Алексеевича и уполномоченных ей лиц (далее – Оператор), регулирующей деятельность в области обработки и защиты персональных данных.</p>
              <p>1.2. Политика разработана в целях реализации требований законодательства Российской Федерации в области обработки и защиты персональных данных и направлена на обеспечение защиты прав и свобод человека и гражданина при обработке его персональных данных Оператором, в том числе защиты прав на неприкосновенность частной жизни, личной и семейной тайн.</p>
              <p>1.3. Действие настоящей Политики распространяется на любую информацию о пользователе, полученную Оператором, как до, так и после утверждения Политики.</p>
              <p>1.4. Действие настоящей Политики распространяется на всю информацию, которую Оператор может получить о пользователе, в том числе во время использования им сайта mypolyana18.ru (далее – Сайт).</p>
              <p>1.5. Посещение и использование Сайта означает безоговорочное согласие пользователя:</p>
              <ul>
                <li>на обработку его персональных данных, указанных статье 2 настоящей Политики;</li>
                <li>с условиями обработки его персональных данных, содержащимися в настоящей Политике.</li>
              </ul>
              <p>1.6. В случае несогласия с условиями обработки персональных данных Оператором, пользователь должен прекратить использование Сайта.</p>
              <p>1.7. Настоящая Политика применяется только к сайту mypolyana18.ru Оператор не контролирует и не несет ответственности за сбор и обработку персональных данных третьими лицами, на сайты которых пользователь может перейти по ссылкам, доступным на сайте mypolyana18.ru.</p>
              <p>1.8. Оператор не осуществляет проверку достоверности персональных данных, предоставленных пользователем.</p>
              <h3>2. СОСТАВ ПОЛУЧАЕМЫХ И ОБРАБАТЫВАЕМЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>
              <p>2.1. Данные о пользователе, получаемые и обрабатываемые в рамках настоящей Политики поступают Оператору следующими способами:</p>
              <p>2.1.1. Предоставляются самим пользователем на Сайте путем:</p>
              <ul>
                <li>заполнения всплывающей формы «заказать обратный звонок» и включает в себя следующую информацию: имя, номер контактного телефона;</li>
                <li>заполнения формы «оставить заявку» и включает в себя следующую информацию: имя, номер контактного телефона;</li>
                <li>заполнения всплывающей формы «узнать подробнее» и включает в себя следующую информацию: имя, номер контактного телефона;</li>
                <li>заполнения всплывающей формы «забронировать участок» и включает в себя следующую информацию: имя, номер контактного телефона;</li>
                <li>заполнения всплывающей формы «заказать звонок» и включает в себя следующую информацию: имя, номер контактного телефона;</li>
              </ul>
              <p>2.1.2. Автоматически передаются Оператору в процессе посещения и использования Сайта с помощью установленного на устройстве пользователя программного обеспечения, в том числе: IP-адрес, информация из cookie, информация о браузере пользователя (или иной программе, с помощью которой осуществляется доступ к сайту), время доступа, адрес запрашиваемой страницы.</p>
              <h3>3. ЦЕЛИ СБОРА И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ</h3>
              <p>3.1. Сбор и обработка персональных данных пользователя Оператором осуществляется в следующих целях:</p>
              <p>3.1.1. Идентификация пользователя в рамках правоотношений с Оператором;</p>
              <p>3.1.2. Заключение договоров с пользователем от имени Оператора и (или) его партнеров.</p>
              <p>3.1.3. Связь с пользователем в случае необходимости, в том числе направление уведомлений, запросов и информации, связанных с использованием Сайта, оказанием услуг Оператором, а также обработка запросов и заявок от пользователя;</p>
              <p>3.1.4. Предоставление пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием Сайта;</p>
              <p>3.1.5. Повышение качества Сайта, удобства его использования;</p>
              <p>3.1.6. Предоставление пользователю, с его согласия, персональных услуг, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Оператора и (или) от имени его партнеров;</p>
              <p>3.1.7. Осуществления рекламной деятельности с согласия пользователя;</p>
              <p>3.1.8. Предоставления доступа пользователю на сайты или сервисы партнеров Оператора с целью получения продуктов, обновлений и услуг.</p>
              <p>3.1.9. Проведение статистических и иных исследований, на основе обезличенных данных.</p>
              <h3>4. ПРЕДОСТАВЛЕНИЕ ДОСТУПА К ПЕРСОНАЛЬНЫМ ДАННЫМ</h3>
              <p>4.1. Оператор обеспечивает сохранность персональных данных пользователей.</p>
              <p>4.2. Обрабатываемые персональные данные уничтожаются либо обезличиваются Оператором по достижении целей обработки или в случае утраты необходимости в достижении этих целей, а также при отзыве Пользователем согласия на обработку персональных данных.</p>
              <p>4.3. Пользователь вправе в любой момент отозвать согласие на обработку Оператором персональных данных путём направления письменного уведомления на адрес: 426000, г. Ижевск ул. Кирова д. 116, а/я 10125, с пометкой «отзыв согласия на обработку персональных данных». Отзыв пользователем согласия на обработку персональных данных влечёт за собой уничтожение записей, содержащих персональные данные, в системах обработки персональных данных Оператора.</p>
              <p>4.4. В отношении персональных данных пользователя сохраняется их конфиденциальность, кроме случаев, установленных в п. 4.5. настоящей Политики.</p>
              <p>4.5. Оператор вправе передать персональные данные пользователя третьим лицам в следующих случаях:</p>
              <p>4.5.1. Пользователь явным образом выразил свое согласие на передачу своих персональных данных;</p>
              <p>4.5.2. Передача персональных данных необходима для оказания определенной услуги пользователю Оператором или его партнерами. При этом обеспечивается конфиденциальность персональной информации, а пользователь уведомляется о такой передаче;</p>
              <p>4.5.3. Передача предусмотрена российским или иным применимым законодательством в рамках установленной процедуры (по решению суда, запросу правоохранительных органов и т.д.);</p>
              <p>4.5.4. Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации;</p>
              <p>4.5.5. В целях обеспечения возможности защиты прав и законных интересов Оператора.</p>
              <p>4.6. При утрате или разглашении персональных данных Оператор информирует пользователя об утрате или разглашении персональных данных.</p>
              <h3>5. ЗАЩИТА ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ</h3
              <p>5.1. Оператор гарантирует, что уровень защищенности персональных данных пользователей соответствует требованиям, установленным в Постановлении Правительства Российской Федерации от 1 ноября 2012 г. № 1119 «Об утверждении требований к защите персональных данных при их обработке в информационных системах персональных данных».</p>
              <p>5.2. Оператор принимает необходимые организационные и технические меры для защиты персональных данных пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц в соответствии с требованиями Приказа ФСТЭК России от 18.02.2013 № 21 «Об утверждении Состава и содержания организационных и технических мер по обеспечению безопасности персональных данных при их обработке в информационных системах персональных данных».</p>
              <h3>6. ОТВЕТСТВЕННОСТЬ</h3>
              <p>6.1. В случае неисполнения своих обязательств, Оператор несёт ответственность за убытки, понесённые пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных 6.2. настоящей Политики.</p>
              <p>6.2. В случае утраты или разглашения персональных данных пользователя Оператор не несёт ответственность, если данная информация стала публичным достоянием до её утраты или разглашения, либо была разглашена самим пользователем или с согласия пользователя.</p>
              <h3>7. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h3>
              <p>7.1. Оператор вправе вносить изменения и дополнения в настоящую Политику. Новая редакция Политики действует с момента ее размещения на сайте mypolyana18.ru, если иное не предусмотрено в новой редакции Политики.</p>
              <p>7.2. К отношениям в области обработки и защиты персональных данных, не урегулированным в настоящей Политике, применяется действующее законодательство Российской Федерации.</p>
              <p>7.3. Все предложения или вопросы, связанные с обработкой и защитой персональных данных Оператором следует направлять по адресу электронной почты kpolyana18@yandex.ru.</p>
              <p>7.4. Данные оператора персональных данных:</p>
              <p><b>Индивидуальный предприниматель Кокин Александр Алексеевич</b><br>
              <b>ИНН</b> 183060991570<br>
              <b>ОГРНИП</b> 318183200056900<br>
              <b>ОКВЭД</b> 68.10, 81.30, 71.11.3, 68.32, 43.91<br>
              <b>Юридический адрес</b> 427005, УР, Завьяловский р-н, д. Старый Чультем, ул. Изумрудная, д.27<br>
              <b>Почтовый адрес</b> 426000, г. Ижевск, ул. Кирова, д.116, а\я 10125<br>
              <b>Расчётный счёт</b> 40802810268000016690<br>
              <b>Наименование банка</b> УДМУРТСКОЕ ОТДЕЛЕНИЕ №8618 ПАО СБЕРБАНК<br>
              <b>БИК</b> 049401601<br>
              <b>Корреспондирующий счёт</b> 30101810400000000601<br></p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>`
});